xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/general/tricore/inc/TC23x/IfxCbs_regdef.h
/** \brief  TG Capture for OTGB0/1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TCTGB_Bits B;                   /**< \brief Bitfield access */
} Ifx_CBS_TCTGB;

/** \brief  TG Capture for TG Lines */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TCTL_Bits B;                    /**< \brief Bitfield access */
} Ifx_CBS_TCTL;

/** \brief  TG Input Pins Routing */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TIPR_Bits B;                    /**< \brief Bitfield access */
} Ifx_CBS_TIPR;

/** \brief  TG Line 1 Suspend Targets */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TL1ST_Bits B;                   /**< \brief Bitfield access */
} Ifx_CBS_TL1ST;

/** \brief  TG Line Control */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TLC_Bits B;                     /**< \brief Bitfield access */
} Ifx_CBS_TLC;

/** \brief  TG Line Counter Control */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TLCC_Bits B;                    /**< \brief Bitfield access */
} Ifx_CBS_TLCC;

/** \brief  TG Line Capture and Hold Enable */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TLCHE_Bits B;                   /**< \brief Bitfield access */
} Ifx_CBS_TLCHE;

/** \brief  TG Line Capture and Hold Clear */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TLCHS_Bits B;                   /**< \brief Bitfield access */
} Ifx_CBS_TLCHS;

/** \brief  TG Line Counter Value */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TLCV_Bits B;                    /**< \brief Bitfield access */
} Ifx_CBS_TLCV;

/** \brief  TG Line State */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TLS_Bits B;                     /**< \brief Bitfield access */
} Ifx_CBS_TLS;

/** \brief  TG Line Timer */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TLT_Bits B;                     /**< \brief Bitfield access */
} Ifx_CBS_TLT;

/** \brief  TG Lines for Trigger to Host */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TLTTH_Bits B;                   /**< \brief Bitfield access */
} Ifx_CBS_TLTTH;

/** \brief  TG Output Pins Pulse Stretcher */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TOPPS_Bits B;                   /**< \brief Bitfield access */
} Ifx_CBS_TOPPS;

/** \brief  TG Output Pins Routing */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TOPR_Bits B;                    /**< \brief Bitfield access */
} Ifx_CBS_TOPR;

/** \brief  TG Routing for CPU */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TRC_Bits B;                     /**< \brief Bitfield access */
} Ifx_CBS_TRC;

/** \brief  TG Routing Events of CPU */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TREC_Bits B;                    /**< \brief Bitfield access */
} Ifx_CBS_TREC;

/** \brief  TG Routing for Control */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TRHSM_Bits B;                   /**< \brief Bitfield access */
} Ifx_CBS_TRHSM;

/** \brief  Trigger to Host Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TRIG_Bits B;                    /**< \brief Bitfield access */
} Ifx_CBS_TRIG;

/** \brief  Clear Trigger to Host Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TRIGC_Bits B;                   /**< \brief Bitfield access */
} Ifx_CBS_TRIGC;

/** \brief  Set Trigger to Host Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TRIGS_Bits B;                   /**< \brief Bitfield access */
} Ifx_CBS_TRIGS;

/** \brief  TG Routing for MCDS Control */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TRMC_Bits B;                    /**< \brief Bitfield access */
} Ifx_CBS_TRMC;

/** \brief  TG Routing for MCDS Triggers */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TRMT_Bits B;                    /**< \brief Bitfield access */
} Ifx_CBS_TRMT;

