xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/general/tricore/inc/TC23x/IfxCbs_regdef.h
/** \brief  TG Routing for Special Signals */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TRSS_Bits B;                    /**< \brief Bitfield access */
} Ifx_CBS_TRSS;

/** \brief  TG Routing for OTGB Bits [15:8] */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TRTGB_H_Bits B;                 /**< \brief Bitfield access */
} Ifx_CBS_TRTGB_H;

/** \brief  TG Routing for OTGB Bits [7:0] */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CBS_TRTGB_L_Bits B;                 /**< \brief Bitfield access */
} Ifx_CBS_TRTGB_L;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cbs_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \brief  TG Routing for OTGB */
typedef volatile struct _Ifx_CBS_TRTGB
{
    Ifx_CBS_TRTGB_L L;                      /**< \brief 0, TG Routing for OTGB Bits [7:0] */
    Ifx_CBS_TRTGB_H H;                      /**< \brief 4, TG Routing for OTGB Bits [15:8] */
} Ifx_CBS_TRTGB;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cbs_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief  CBS object */
typedef volatile struct _Ifx_CBS
{
    unsigned char reserved_0[8];            /**< \brief 0, \internal Reserved */
    Ifx_CBS_JDPID JDPID;                    /**< \brief 8, Module Identification Register */
    Ifx_CBS_OIFM OIFM;                      /**< \brief C, OCDS Interface Mode Register */
    Ifx_CBS_TIPR TIPR;                      /**< \brief 10, TG Input Pins Routing */
    Ifx_CBS_TOPR TOPR;                      /**< \brief 14, TG Output Pins Routing */
    Ifx_CBS_TOPPS TOPPS;                    /**< \brief 18, TG Output Pins Pulse Stretcher */
    Ifx_CBS_TCIP TCIP;                      /**< \brief 1C, TG Capture for TG Input Pins */
    Ifx_CBS_TRC TRC[1];                     /**< \brief 20, TG Routing for CPU */
    unsigned char reserved_24[20];          /**< \brief 24, \internal Reserved */
    Ifx_CBS_TRHSM TRHSM;                    /**< \brief 38, TG Routing for Control */
    Ifx_CBS_TRMC TRMC;                      /**< \brief 3C, TG Routing for MCDS Control */
    Ifx_CBS_TLCC TLCC[2];                   /**< \brief 40, TG Line Counter Control */
    unsigned char reserved_48[8];           /**< \brief 48, \internal Reserved */
    Ifx_CBS_TLCV TLCV[2];                   /**< \brief 50, TG Line Counter Value */
    unsigned char reserved_58[8];           /**< \brief 58, \internal Reserved */
    Ifx_CBS_TRSS TRSS;                      /**< \brief 60, TG Routing for Special Signals */
    Ifx_CBS_JTAGID JTAGID;                  /**< \brief 64, JTAG Device Identification Register */
    Ifx_CBS_COMDATA COMDATA;                /**< \brief 68, Communication Mode Data Register */
    Ifx_CBS_IOSR IOSR;                      /**< \brief 6C, IOClient Status and Control Register */
    Ifx_CBS_TLS TLS;                        /**< \brief 70, TG Line State */
    Ifx_CBS_TCTL TCTL;                      /**< \brief 74, TG Capture for TG Lines */
    Ifx_CBS_OEC OEC;                        /**< \brief 78, OCDS Enable Control Register */
    Ifx_CBS_OCNTRL OCNTRL;                  /**< \brief 7C, OSCU Control Register */
    Ifx_CBS_OSTATE OSTATE;                  /**< \brief 80, OSCU Status Register */
    Ifx_CBS_INTMOD INTMOD;                  /**< \brief 84, Internal Mode Status and Control Register */
    Ifx_CBS_ICTSA ICTSA;                    /**< \brief 88, Internally Controlled Trace Source Register */
    Ifx_CBS_ICTTA ICTTA;                    /**< \brief 8C, Internally Controlled Trace Destination Register */
    Ifx_CBS_TLC TLC;                        /**< \brief 90, TG Line Control */
    Ifx_CBS_TL1ST TL1ST;                    /**< \brief 94, TG Line 1 Suspend Targets */
    Ifx_CBS_TLCHE TLCHE;                    /**< \brief 98, TG Line Capture and Hold Enable */
    Ifx_CBS_TLCHS TLCHS;                    /**< \brief 9C, TG Line Capture and Hold Clear */
    Ifx_CBS_TRIGS TRIGS;                    /**< \brief A0, Set Trigger to Host Register */
    Ifx_CBS_TRIGC TRIGC;                    /**< \brief A4, Clear Trigger to Host Register */
    Ifx_CBS_TLT TLT;                        /**< \brief A8, TG Line Timer */
    Ifx_CBS_TLTTH TLTTH;                    /**< \brief AC, TG Lines for Trigger to Host */
    Ifx_CBS_TCCB TCCB;                      /**< \brief B0, TG Capture for Cores - BRKOUT */
    Ifx_CBS_TCCH TCCH;                      /**< \brief B4, TG Capture for Cores - HALT */
    Ifx_CBS_TCTGB TCTGB;                    /**< \brief B8, TG Capture for OTGB0/1 */
    Ifx_CBS_TCM TCM;                        /**< \brief BC, TG Capture for MCDS */
    Ifx_CBS_TREC TREC[1];                   /**< \brief C0, TG Routing Events of CPU */
    unsigned char reserved_C4[24];          /**< \brief C4, \internal Reserved */
    Ifx_CBS_TRMT TRMT;                      /**< \brief DC, TG Routing for MCDS Triggers */
    Ifx_CBS_TRTGB TRTGB[2];                 /**< \brief E0, TG Routing for OTGB */
    unsigned char reserved_F0[16];          /**< \brief F0, \internal Reserved */
    Ifx_CBS_TRIG TRIG[6];                   /**< \brief 100, Trigger to Host Register */
    unsigned char reserved_118[232];        /**< \brief 118, \internal Reserved */
} Ifx_CBS;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCBS_REGDEF_H */
